using System.Collections.Generic;

public class Error
{
    public static Dictionary<int, string> ErrorMessage = new Dictionary<int, string>()
    {
        {0, "成功"},
        {-1, "token不合法"}, // 身分不合法
        {-2, "沒有權限"}, // 沒有權限
        {-3, "Request參數未填or有問題"}, // Request參數未填or有問題
        {-4, "查無結果"}, // 查無結果
        {-5, "帳號or密碼錯誤"}, // 帳號or密碼錯誤
        {-6, "舊密碼錯誤"}, // 舊密碼錯誤
        {-7, "確認密碼錯誤"}, // 確認密碼錯誤
        {-8, "Token未存在"}, // Token未存在
        {-9, "重複登入"}, // 重複登入
        {-10, "Login過期"}, // Login過期
        {-11, "帳號已封存"}, // 帳號已封存
        {-12, "權限新增失敗"}, // 權限新增失敗
        {-13, "權限修改失敗"}, // 權限修改失敗
        {-14, "此信箱已註冊"}, // 此信箱已註冊
        {-15, "此帳號已註冊"}, // 此帳號已註冊
        {-16, "圖片庫沒有此照片"}, //圖片庫沒有此照片
        {-17, "沒有此Youtube Id"}, //沒有此Youtube Id
        {-18, "此課程無法被修改"}, // 此課程無法被修改
        {-19, "密鑰錯誤"},
        {-20, "此課程無法被封存"}, // 此課程無法被封存
        {-21, "已有此Tag"}, // 已有此Tag
        {-22, "此Tag無法被封存"}, // 此Tag無法被封存
        {-23, "無法修改發布時間"}, // 此Tag無法被封存
        {-24, "沒有此Youtube Channel Id"}, //沒有此Youtube Id
        {-25, "此Youtube Id無法新增於這個頻道"}, //沒有此Youtube Id
        {-26, "此頻道無法被封存"}, // 此課程無法被封存
        {-27, "此頻道目前正在被使用"}, // 此頻道目前正在被使用
        {-28, "此使用者已新增過此頻道"}, // 此使用者已新增過此頻道
        {-1000, "資料庫異常"}, // 資料庫異常
        {-1001, "HTTP 服務器發送請求異常"} // HTTP 服務器發送請求異常
    };

}